data/000_ex/run_of13_blockMesh_linearUpwind/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: 13                                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; location "system"; object controlDict; }
// OpenFOAM 13: 流れを凍結(subSolverTime 0)し、scalarTransport関数でTを移流する
solver          functions;
subSolver       incompressibleFluid;
startFrom       startTime;
startTime       0;
subSolverTime   0;
stopAt          endTime;
endTime         200;
deltaT          0.5;
writeControl    runTime;
writeInterval   40;
purgeWrite      0;
writeFormat     ascii;
writePrecision  7;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    #includeFunc scalarTransport(T, diffusivity=constant, D=0)
}
