data/000_ex/run_of13_blockMesh_linearUpwind/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 流れ(+x)に整列した長方形メッシュ。斜めメッシュ(元のUNV, 1125セル)と
// セル数をそろえる(47 x 24 = 1128セル)。y=25 でブロックを上下に分け、
// 入口を inletTop(30 degC) / inletBottom(50 degC) にする。

scale   1;

vertices
(
    (  0   0   0)   //  0
    (100   0   0)   //  1
    (100  25   0)   //  2
    (  0  25   0)   //  3
    (  0   0  10)   //  4
    (100   0  10)   //  5
    (100  25  10)   //  6
    (  0  25  10)   //  7
    (  0  50   0)   //  8
    (100  50   0)   //  9
    (  0  50  10)   // 10
    (100  50  10)   // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7)    (47 12 1) simpleGrading (1 1 1)   // 下ブロック y:0-25
    hex (3 2 9 8 7 6 11 10)  (47 12 1) simpleGrading (1 1 1)   // 上ブロック y:25-50
);

edges
(
);

boundary
(
    inletBottom
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    inletTop
    {
        type patch;
        faces ( (3 7 10 8) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) (2 9 11 6) );
    }
    bottomWall
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    topWall
    {
        type wall;
        faces ( (8 9 11 10) );
    }
    frontBack
    {
        type empty;
        faces ( (0 3 2 1) (4 5 6 7) (3 8 9 2) (7 6 11 10) );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
