data/000_ex/run_of13_blockMesh_linearUpwind/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: 13                                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; location "constant"; object momentumTransport; }
simulationType  laminar;
