data/000_ex/run_of13_blockMesh_linearUpwind/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: 13                                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; location "constant"; object physicalProperties; }
viscosityModel  constant;
nu              1e-05;
