data/000_ex/run_of13_blockMesh_linearUpwind/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: v2512                                 |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);
boundaryField
{
    inletTop    { type fixedValue; value uniform (1 0 0); }
    inletBottom { type fixedValue; value uniform (1 0 0); }
    outlet      { type zeroGradient; }
    topWall     { type slip; }
    bottomWall  { type slip; }
    frontBack   { type empty; }
}
// ************************************************************************* //
