data/000_ex/run_of13_blockMesh_linearUpwind/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: 13                                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inletTop    { type zeroGradient; }
    inletBottom { type zeroGradient; }
    outlet      { type fixedValue; value uniform 0; }
    topWall     { type zeroGradient; }
    bottomWall  { type zeroGradient; }
    frontBack   { type empty; }
}
