data/000_ex/run_of13_blockMesh_linearUpwind/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: 13                                    |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; location "system"; object fvSchemes; }
ddtSchemes      { default      Euler; }
gradSchemes     { default      Gauss linear; grad(T) Gauss linear; }
divSchemes
{
    default      none;
    div(phi,T)   Gauss linearUpwind grad(T);
}
laplacianSchemes { default    Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default      corrected; }
